[{"id":"1","sortOrder":1,"title":"DONNY OSMOND","subtitle":"Editorial Design  ","showcased":"Donny Osmond Home<br \/> Furniture Catalog \/ Editorial Design \/ Hangtag","media":"Print + Digital","application":"InDesign, Photoshop, Illustrator","development":"Layout aesthetic; content building; creating the flow of each category and collection as well as supporting items; call outs; content development; detail to user navigation from start to end","highlights":"Donny Osmond himself expressed his gratitude to me personally for the vision created that represents his brand during a Las Vegas Market Show!","asset_folder":"1.Donny-Osmond","link":"","pdfs":"2016.pdf,2017.pdf,2018.pdf"},{"id":"2","sortOrder":2,"title":"SCOTT LIVING","subtitle":"Editorial Design \/ POP","showcased":"Scott Living (SL)<br \/> Furniture Catalog \/ Editorial Design, Showroom Banners \/ Hang-tags","media":"Print + Digital ","application":"InDesign, Photoshop, Illustrator","development":"Layout aesthetic + developing working files, complying with the evolving new entity of SL \/ SBG. Collecting data, adjusting studio photography, page and spread layouts, cover + developing signature data for print.","highlights":"Scott Brothers Global 2019 Tennessee Summit Attendee. Joined with other licensees for the introduction and reveal of the Scott Living brand. ","asset_folder":"2.Scott-Brothers","link":"","pdfs":"2017-2018.pdf,2018-2019.pdf"},{"id":"3","sortOrder":3,"title":"COASTER FURNITURE","subtitle":"POP \/ Editorial Design \/ Give-Aways","showcased":"Coaster<br \/> Furniture Editorial, POP and Give-Aways. *give-away samples available*","media":"Print + Digital ","application":"Illustrator, InDesign, Photoshop","development":"TOP: create a fun and engaging visual informational campaign that included a brochure, stand, poster, and email blast for PROP 65. Explored visual engagement to take the viewer on a tour of the complex topic.\n\nBOTTOM: Worked with freelance artist to create and manipulate characters. Developed an array of patterns in Illustrator to be displayed on “giveaways” such as recycled bags, umbrellas and other media.\n\nCreated mocks and hangtag. \nSamples available.  ","highlights":"","asset_folder":"3.Print","link":"","pdfs":""},{"id":"4","sortOrder":4,"title":"COASTER FURNITURE","subtitle":"Web Collateral","showcased":"Oops! Correction to an email campaign sent with broken links. Also shown, web slides, and digital web assets","media":"Digital, web","application":"InDesign, Photoshop, Illustrator, Mailchimp, Dreamweaver, ISSUU","development":"TOP: communicate with the audience about an error from the original email. The goal was to present something fun and convey accurate information to the end user minimizing frustration and acknowledging the mistake. \n\n2: Web slides hosted on one of the Coaster Company websites. Based on the time of year, slides were created to tell a story of a particular event: market show announcements, social media links, special promotions. \n\n3: Develop a visual web portal that allows end user to access web friendly converted print material: catalogs, images and informational spread sheets.","highlights":"","asset_folder":"4.Web","link":"","pdfs":""},{"id":"5","sortOrder":5,"title":"PERENNIAL STRENGTH","subtitle":"Identity","showcased":"Perennial Strength Identity","media":"Print, Web","application":"InDesign, Photoshop, Illustrator","development":"Create identity for a Cross-Fit coach. Developed color scheme, logo, social media banners, mailers, business card and the website visual aspects and navigation. Worked with a web developer for live website:","highlights":"","asset_folder":"5.Perennial-Strength","link":"https:\/\/perennialstrength.com\/","pdfs":""}]