[{"id":"22","showHide":"show","sortOrder":"22","title":"Robinson Helicopter Configurator","description":"Created a helicopter Configurator to assist their Sales Agents in choosing the right color, instruments and items for their helicopter.","image":"\/assets\/img\/portfolio-assets\/rhc.jpg","link":"https:\/\/robinsonheli-configurator.com\/rhc\/hID\/R44-CDT"},{"id":"21","showHide":"show","sortOrder":"21","title":"LA Modern Auctions","description":"Develop and maintain their Web application and Wordpress CMS. The apps I have developed here support online bidding for their quarterly Auctions. This involves adding new lots, changing to the various states of the auction (upcoming, current, post, and past). Interactive lot naviagtor with gallery to support multiple images and zoming needs. As well as lot specific states for costs, price realized, and selling now. Currently in the process of converting their Wordpress Front facing website into React, Redux, and Laravel Front End with backend API. Removing third party plugins to connect to authorize.net for purchasing catalogues and auction related transactions.","image":"\/assets\/img\/portfolio-assets\/lamodern.jpg","link":"https:\/\/lamodern.com"},{"id":"18","showHide":"show","sortOrder":"18","title":"CTM Loyalty Applications","description":"<p>\n    Formerly Montrose Travel, Corporate Travel Management (CTM) handles all sorts of travel needs. I  helped to develop and maintain their Loyalty appliedctions which serve Banks and Credit Unions, letting their customers use their points to book a Flight, Hotel, Car, Cruises, and Travel Packages. \n<\/p>\n\n<p>\n\n    CTM has given me the opportunity to work in large teams (Agile) with many developers, quality assurance (QA), Scrum Masters, Product Managers, Business Analysts, Dev Managers, etc. Working on this team has expanded my ability to not only work with others, but to share code. \n<\/p>\n\n<p>\n    When developing solo projects you can do what you want, and, perhaps cut some corners just to meet a deadline.  When working in a team with Code Reviews, QA, and UAT, you learn a lot about building more scalable, maintainable code. \n<\/p>\n\n<p>\n    While at CTM I also:\n<\/p>\n\n<ul>\n    <li>Assisted in Dockerizing containers for our local developers<\/li>\n    <li>\n        Lead the effort for interviewing and onboarding 30 plus developers (working with recruiters, scheduling, screening, developing and grading exams, conducting interviews, and onboarding)\n    <\/li>\n    <li>Started an in-house NPM Package library to share features across our 2 primary apps, reducing duplication of work.<\/li>\n    <li>Helped document many of opur processes, and widgets. The example Decision Tree demonstrates working with Business\/Product to define clearly handling price change logic for flights. This diagram was used by Developers, QA, and Business to ensure we were all on the same page as to expected logic. I then implemented the price change logic along with testing solutions so we could all simulate a price change and test the results. <\/li>\n    <li>Normalized all of our Buttons to take advantage of single source of logic (adhering to ADA 2.1 requirements). This also includes a focus effort to ensure all buttons were clearing, visibly accessible in all views.<\/li>\n    \n<\/ul>","image":"\/assets\/img\/portfolio-assets\/ctm.jpg","link":"https:\/\/archives.mitchellgohman.com\/ctm.com"},{"id":"17","showHide":"show","sortOrder":"17","title":"Enspyred LMS","description":"This application has been through many iterations throughout my life as a web developer. I have used to to teach my Web Development courses, and as a way to play with tools I may not otherwise get to work with. It is a full blown Learning Management System with Admin backend  that supports registering for courses, assignment submissions, grading and grade reports, structured content for syllabus, session outline, and resource sharing.","image":"\/assets\/img\/portfolio-assets\/enspyred.jpg","link":"https:\/\/enspyred.com"},{"id":"16","showHide":"show","sortOrder":"16","title":"Christina Gohman","description":"My wife's portfolio Website. She designs, I develop. I may have a bias as well, but she is an amazing designer. Her attention to details, spatial relatonships, color and typography is not common knowledge. We have also worked on several web sites where she created the designs\/mocks\/assets and I translated her vision into html, css, and javascript.","image":"\/assets\/img\/portfolio-assets\/christinagohman.jpg","link":"https:\/\/christinagohman.com"},{"id":"15","showHide":"show","sortOrder":"15","title":"Diggity Doggy Daycare","description":"Who doesn't like dogs? And Diggity Doggy Daycare, is the best daycare I know. If only I lived closer, my dogs would be there. Tommy Gabl the owner is a longtime friend, so we have been able to develop this website in a remote fashion.","image":"\/assets\/img\/portfolio-assets\/diggitydoggy.jpg","link":"https:\/\/diggitydoggy.com"},{"id":"14","showHide":"show","sortOrder":"14","title":"Perennial Strength","description":"My wife Christin Designed and I developed this Wordpress web application. Custom theme, tailored to client needs.","image":"\/assets\/img\/portfolio-assets\/perennialstrength.jpg","link":"https:\/\/perennialstrength.com"},{"id":"13","showHide":"show","sortOrder":"13","title":"LA Home and Style","description":"Worked with a Designer to build this Wordpress website that provides Home Listings in LA and Promotes the business.","image":"\/assets\/img\/portfolio-assets\/lahomeandstyle.jpg","link":"https:\/\/archives.mitchellgohman.com\/lahomeandstyle.com"},{"id":"12","showHide":"show","sortOrder":"12","title":"Team CrossFit Academy","description":"Team CrossFit Academy and I go way back, as I not only Developed and maintained thier website, I also trained with them. Truly an amazing service, and the owner gave me a lot of creative freedom with the website to help promote their business and inform their clientelle.","image":"\/assets\/img\/portfolio-assets\/teamcrossfitacademy.jpg","link":"https:\/\/archives.mitchellgohman.com\/teamcrossfitacademy.com"},{"id":"11","showHide":"show","sortOrder":"11","title":"Sexy Organic Strong","description":"Designed and developed this website, including the illustrations\/graphics, color scheme translated into a Wordpress application to promote the owner, her business, and products.","image":"\/assets\/img\/portfolio-assets\/sexyorganicstrong.jpg","link":"https:\/\/sexyorganicstrong.com"},{"id":"9","showHide":"show","sortOrder":"9","title":"JMS Fox Designs","description":"Worked wioth designer to create this non-traditional layout. A lot of fun challenges in this project.","image":"\/assets\/img\/portfolio-assets\/jmsfoxdesign.jpg","link":"https:\/\/jmsfoxdesign.com"},{"id":"8","showHide":"show","sortOrder":"8","title":"Our Wedding","description":"<p>My wife, (<a href='https:\/\/christinagohman.com' target='xtina'>Christina Gohman<\/a>) desaigned and I developed this Wordpress Custom theme for our Wedding. <\/>\n\n<p>It was used to keep all of our guests informed, and boy did that make all the difference in the world. Still one of my favorite designs, is that cause it was my wedding? Nah.<\/p> ","image":"\/assets\/img\/portfolio-assets\/wedding.mitchellgohman.jpg","link":"https:\/\/wedding.mitchellgohman.com"},{"id":"5","showHide":"show","sortOrder":"5","title":"Alexander's Detail","description":"Designed and developed this custom Wordpress theme.","image":"\/assets\/img\/portfolio-assets\/alexandersdetail.jpg","link":"https:\/\/archives.mitchellgohman.com\/alexandersdetail.com"},{"id":"6","showHide":"show","sortOrder":"6","title":"The Real Mansa","description":"Designed and developed this custom Wordpress theme.","image":"\/assets\/img\/portfolio-assets\/therealmansa.jpg","link":"https:\/\/therealmansa.com"},{"id":"4","showHide":"show","sortOrder":"4","title":"CrossFit Survival","description":"Designed and developed this custom Wordpress theme.","image":"\/assets\/img\/portfolio-assets\/crossfitsurvival.jpg","link":"https:\/\/archives.mitchellgohman.com\/crossfitsurvival.com"},{"id":"3","showHide":"show","sortOrder":"3","title":"Sean Dollins Portfolio","description":"A static personal portfolio for Sean Dollins. Sean designed it, and I translated it to web.","image":"\/assets\/img\/portfolio-assets\/seandollins.jpg","link":"https:\/\/archives.mitchellgohman.com\/seandollins.com"},{"id":"1","showHide":"show","sortOrder":"1","title":"Another World Comics","description":"Custom web applicaton using out of the box php, mysql, javascript, html and css.","image":"\/assets\/img\/portfolio-assets\/anotherworldcomics.jpg","link":"https:\/\/archives.mitchellgohman.com\/anotherworldcomics.com"}]